openfoam/tutorials/combustion/fireFoam/LES/oppositeBurningPanels/constant/pyrolysisZones
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      pyrolysisZones;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

pyrolysis
{
    active          true;

    pyrolysisModel  reactingOneDim;

    region          panelRegion;

    reactingOneDimCoeffs
    {
        gasHSource      false; //Energy source term due to pyrolysis gas
        qrHSource       false; //Energy source term due in depht radiation
        minimumDelta    1e-12;

        reactionDeltaMin 1e-12;

        moveMesh        false;
    }

    infoOutput      true;
}


// ************************************************************************* //
